ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
// Copyright 2017 jem@seethis.link
// Licensed under the MIT license (http://opensource.org/licenses/MIT)

#pragma once

///////////////////////////////////////////////////////////////////////////////
//                             ADC                                           //
///////////////////////////////////////////////////////////////////////////////

// ADC0CF: ADC0 Configuration
//
#define AD0SC_gp 3
#define AD0SC_gm (0x1f << AD0SC_gp)

#define AD0LJST_bp 2
#define AD0LJST_bm (1 << AD0LJST_bp)

// ADC0CN: ADC0 Control
#define AD0EN_bp 7
#define AD0EN_bm (1 << AD0EN_bp)
#define AD0TM_bp 6
#define AD0TM_bm (1 << AD0TM_bp)
#define AD0INT_bp 5
#define AD0INT_bm (1 << AD0INT_bp)
#define AD0BUSY_bp 4
#define AD0BUSY_bm (1 << AD0BUSY_bp)
#define AD0WINT_bp 3
#define AD0WINT_bm (1 << AD0WINT_bp)

#define AD0CM_gp 0
#define AD0CM_gm 0x07
enum {
    AD0CM_AD0BUSY = 0b000,
    AD0CM_TIMER0  = 0b001,
    AD0CM_TIMER2  = 0b010,
    AD0CM_TIMER1  = 0b011,
    AD0CM_CNVSTR  = 0b100,
    AD0CM_TIMER3  = 0b101,
    AD0CM_TIMER4  = 0b110,
    AD0CM_TIMER5  = 0b111,
};
enum {
    AD0CM_AD0BUSY_gc = 0b000 << AD0CM_gp,
    AD0CM_TIMER0_gc  = 0b001 << AD0CM_gp,
    AD0CM_TIMER2_gc  = 0b010 << AD0CM_gp,
    AD0CM_TIMER1_gc  = 0b011 << AD0CM_gp,
    AD0CM_CNVSTR_gc  = 0b100 << AD0CM_gp,
    AD0CM_TIMER3_gc  = 0b101 << AD0CM_gp,
    AD0CM_TIMER4_gc  = 0b110 << AD0CM_gp,
    AD0CM_TIMER5_gc  = 0b111 << AD0CM_gp,
};

// AMX0P: AMUX0 Positive Channel Select
#define AMX0P_gp 0
#define AMX0P_gm 0x3f
enum {
    AMX0P_32PIN_P1_0        = 0b000000,
    AMX0P_32PIN_P1_1        = 0b000001,
    AMX0P_32PIN_P1_2        = 0b000010,
    AMX0P_32PIN_P1_3        = 0b000011,
    AMX0P_32PIN_P1_4        = 0b000100,
    AMX0P_32PIN_P1_5        = 0b000101,
    AMX0P_32PIN_P1_6        = 0b000110,
    AMX0P_32PIN_P1_7        = 0b000111,
    AMX0P_32PIN_P2_0        = 0b001000,
    AMX0P_32PIN_P2_1        = 0b001001,
    AMX0P_32PIN_P2_2        = 0b001010,
    AMX0P_32PIN_P2_3        = 0b001011,
    AMX0P_32PIN_P2_4        = 0b001100,
    AMX0P_32PIN_P2_5        = 0b001101,
    AMX0P_32PIN_P2_6        = 0b001110,
    AMX0P_32PIN_P2_7        = 0b001111,
    AMX0P_32PIN_P3_0        = 0b010000,
    AMX0P_32PIN_P0_0        = 0b010001,
    AMX0P_32PIN_P0_1        = 0b010010,
    AMX0P_32PIN_P0_4        = 0b010011,
    AMX0P_32PIN_P0_5        = 0b010100,
    AMX0P_32PIN_TEMP_SENSOR = 0b011110,
    AMX0P_32PIN_VDD         = 0b011111,
};
enum {
    AMX0P_32PIN_P1_0_gc        = 0b000000 << AMX0P_gp,
    AMX0P_32PIN_P1_1_gc        = 0b000001 << AMX0P_gp,
    AMX0P_32PIN_P1_2_gc        = 0b000010 << AMX0P_gp,
    AMX0P_32PIN_P1_3_gc        = 0b000011 << AMX0P_gp,
    AMX0P_32PIN_P1_4_gc        = 0b000100 << AMX0P_gp,
    AMX0P_32PIN_P1_5_gc        = 0b000101 << AMX0P_gp,
    AMX0P_32PIN_P1_6_gc        = 0b000110 << AMX0P_gp,
    AMX0P_32PIN_P1_7_gc        = 0b000111 << AMX0P_gp,
    AMX0P_32PIN_P2_0_gc        = 0b001000 << AMX0P_gp,
    AMX0P_32PIN_P2_1_gc        = 0b001001 << AMX0P_gp,
    AMX0P_32PIN_P2_2_gc        = 0b001010 << AMX0P_gp,
    AMX0P_32PIN_P2_3_gc        = 0b001011 << AMX0P_gp,
    AMX0P_32PIN_P2_4_gc        = 0b001100 << AMX0P_gp,
    AMX0P_32PIN_P2_5_gc        = 0b001101 << AMX0P_gp,
    AMX0P_32PIN_P2_6_gc        = 0b001110 << AMX0P_gp,
    AMX0P_32PIN_P2_7_gc        = 0b001111 << AMX0P_gp,
    AMX0P_32PIN_P3_0_gc        = 0b010000 << AMX0P_gp,
    AMX0P_32PIN_P0_0_gc        = 0b010001 << AMX0P_gp,
    AMX0P_32PIN_P0_1_gc        = 0b010010 << AMX0P_gp,
    AMX0P_32PIN_P0_4_gc        = 0b010011 << AMX0P_gp,
    AMX0P_32PIN_P0_5_gc        = 0b010100 << AMX0P_gp,
    AMX0P_32PIN_TEMP_SENSOR_gc = 0b011110 << AMX0P_gp,
    AMX0P_32PIN_VDD_gc         = 0b011111 << AMX0P_gp,
};
enum {
    AMX0P_48PIN_P2_0        = 0b000000,
    AMX0P_48PIN_P2_1        = 0b000001,
    AMX0P_48PIN_P2_2        = 0b000010,
    AMX0P_48PIN_P2_3        = 0b000011,
    AMX0P_48PIN_P2_5        = 0b000100,
    AMX0P_48PIN_P2_6        = 0b000101,
    AMX0P_48PIN_P3_0        = 0b000110,
    AMX0P_48PIN_P3_1        = 0b000111,
    AMX0P_48PIN_P3_4        = 0b001000,
    AMX0P_48PIN_P3_5        = 0b001001,
    AMX0P_48PIN_P3_7        = 0b001010,
    AMX0P_48PIN_P4_0        = 0b001011,
    AMX0P_48PIN_P4_3        = 0b001100,
    AMX0P_48PIN_P4_4        = 0b001101,
    AMX0P_48PIN_P4_5        = 0b001110,
    AMX0P_48PIN_P4_6        = 0b001111,
    // AMX0P_48PIN_Px_x        = 0b010000,
    AMX0P_48PIN_P0_3        = 0b010001,
    AMX0P_48PIN_P0_4        = 0b010010,
    AMX0P_48PIN_P1_1        = 0b010011,
    AMX0P_48PIN_P1_2        = 0b010100,
    AMX0P_48PIN_P1_0        = 0b010101,
    AMX0P_48PIN_P1_3        = 0b010110,
    AMX0P_48PIN_P1_6        = 0b010111,
    AMX0P_48PIN_P1_7        = 0b011000,
    AMX0P_48PIN_P2_4        = 0b011001,
    AMX0P_48PIN_P2_7        = 0b011010,
    AMX0P_48PIN_P3_2        = 0b011011,
    AMX0P_48PIN_P3_3        = 0b011100,
    AMX0P_48PIN_P3_6        = 0b011101,
    AMX0P_48PIN_TEMP_SENSOR = 0b011110,
    AMX0P_48PIN_VDD         = 0b011111,
    AMX0P_48PIN_P4_1        = 0b100000,
    AMX0P_48PIN_P4_2        = 0b100001,
    AMX0P_48PIN_P4_7        = 0b100010,
};
enum {
    AMX0P_48PIN_P2_0_gc        = 0b000000 << AMX0P_gp,
    AMX0P_48PIN_P2_1_gc        = 0b000001 << AMX0P_gp,
    AMX0P_48PIN_P2_2_gc        = 0b000010 << AMX0P_gp,
    AMX0P_48PIN_P2_3_gc        = 0b000011 << AMX0P_gp,
    AMX0P_48PIN_P2_5_gc        = 0b000100 << AMX0P_gp,
    AMX0P_48PIN_P2_6_gc        = 0b000101 << AMX0P_gp,
    AMX0P_48PIN_P3_0_gc        = 0b000110 << AMX0P_gp,
    AMX0P_48PIN_P3_1_gc        = 0b000111 << AMX0P_gp,
    AMX0P_48PIN_P3_4_gc        = 0b001000 << AMX0P_gp,
    AMX0P_48PIN_P3_5_gc        = 0b001001 << AMX0P_gp,
    AMX0P_48PIN_P3_7_gc        = 0b001010 << AMX0P_gp,
    AMX0P_48PIN_P4_0_gc        = 0b001011 << AMX0P_gp,
    AMX0P_48PIN_P4_3_gc        = 0b001100 << AMX0P_gp,
    AMX0P_48PIN_P4_4_gc        = 0b001101 << AMX0P_gp,
    AMX0P_48PIN_P4_5_gc        = 0b001110 << AMX0P_gp,
    AMX0P_48PIN_P4_6_gc        = 0b001111 << AMX0P_gp,
    // AMX0P_48PIN_Px_x        = 0b010000,
    AMX0P_48PIN_P0_3_gc        = 0b010001 << AMX0P_gp,
    AMX0P_48PIN_P0_4_gc        = 0b010010 << AMX0P_gp,
    AMX0P_48PIN_P1_1_gc        = 0b010011 << AMX0P_gp,
    AMX0P_48PIN_P1_2_gc        = 0b010100 << AMX0P_gp,
    AMX0P_48PIN_P1_0_gc        = 0b010101 << AMX0P_gp,
    AMX0P_48PIN_P1_3_gc        = 0b010110 << AMX0P_gp,
    AMX0P_48PIN_P1_6_gc        = 0b010111 << AMX0P_gp,
    AMX0P_48PIN_P1_7_gc        = 0b011000 << AMX0P_gp,
    AMX0P_48PIN_P2_4_gc        = 0b011001 << AMX0P_gp,
    AMX0P_48PIN_P2_7_gc        = 0b011010 << AMX0P_gp,
    AMX0P_48PIN_P3_2_gc        = 0b011011 << AMX0P_gp,
    AMX0P_48PIN_P3_3_gc        = 0b011100 << AMX0P_gp,
    AMX0P_48PIN_P3_6_gc        = 0b011101 << AMX0P_gp,
    AMX0P_48PIN_TEMP_SENSOR_gc = 0b011110 << AMX0P_gp,
    AMX0P_48PIN_VDD_gc         = 0b011111 << AMX0P_gp,
    AMX0P_48PIN_P4_1_gc        = 0b100000 << AMX0P_gp,
    AMX0P_48PIN_P4_2_gc        = 0b100001 << AMX0P_gp,
    AMX0P_48PIN_P4_7_gc        = 0b100010 << AMX0P_gp,
};

// AMX0N: AMUX0 Negative Channel Select
#define AMX0N_gp 0
#define AMX0N_gm 0x3f
enum {
    AMX0N_32PIN_P1_0 = 0b000000,
    AMX0N_32PIN_P1_1 = 0b000001,
    AMX0N_32PIN_P1_2 = 0b000010,
    AMX0N_32PIN_P1_3 = 0b000011,
    AMX0N_32PIN_P1_4 = 0b000100,
    AMX0N_32PIN_P1_5 = 0b000101,
    AMX0N_32PIN_P1_6 = 0b000110,
    AMX0N_32PIN_P1_7 = 0b000111,
    AMX0N_32PIN_P2_0 = 0b001000,
    AMX0N_32PIN_P2_1 = 0b001001,
    AMX0N_32PIN_P2_2 = 0b001010,
    AMX0N_32PIN_P2_3 = 0b001011,
    AMX0N_32PIN_P2_4 = 0b001100,
    AMX0N_32PIN_P2_5 = 0b001101,
    AMX0N_32PIN_P2_6 = 0b001110,
    AMX0N_32PIN_P2_7 = 0b001111,
    AMX0N_32PIN_P3_0 = 0b010000,
    AMX0N_32PIN_P0_0 = 0b010001,
    AMX0N_32PIN_P0_1 = 0b010010,
    AMX0N_32PIN_P0_4 = 0b010011,
    AMX0N_32PIN_P0_5 = 0b010100,
    AMX0N_32PIN_VREF = 0b011110,
    AMX0N_32PIN_GND  = 0b011111,
};
enum {
    AMX0N_32PIN_P1_0_gc = 0b000000 << AMX0N_gp,
    AMX0N_32PIN_P1_1_gc = 0b000001 << AMX0N_gp,
    AMX0N_32PIN_P1_2_gc = 0b000010 << AMX0N_gp,
    AMX0N_32PIN_P1_3_gc = 0b000011 << AMX0N_gp,
    AMX0N_32PIN_P1_4_gc = 0b000100 << AMX0N_gp,
    AMX0N_32PIN_P1_5_gc = 0b000101 << AMX0N_gp,
    AMX0N_32PIN_P1_6_gc = 0b000110 << AMX0N_gp,
    AMX0N_32PIN_P1_7_gc = 0b000111 << AMX0N_gp,
    AMX0N_32PIN_P2_0_gc = 0b001000 << AMX0N_gp,
    AMX0N_32PIN_P2_1_gc = 0b001001 << AMX0N_gp,
    AMX0N_32PIN_P2_2_gc = 0b001010 << AMX0N_gp,
    AMX0N_32PIN_P2_3_gc = 0b001011 << AMX0N_gp,
    AMX0N_32PIN_P2_4_gc = 0b001100 << AMX0N_gp,
    AMX0N_32PIN_P2_5_gc = 0b001101 << AMX0N_gp,
    AMX0N_32PIN_P2_6_gc = 0b001110 << AMX0N_gp,
    AMX0N_32PIN_P2_7_gc = 0b001111 << AMX0N_gp,
    AMX0N_32PIN_P3_0_gc = 0b010000 << AMX0N_gp,
    AMX0N_32PIN_P0_0_gc = 0b010001 << AMX0N_gp,
    AMX0N_32PIN_P0_1_gc = 0b010010 << AMX0N_gp,
    AMX0N_32PIN_P0_4_gc = 0b010011 << AMX0N_gp,
    AMX0N_32PIN_P0_5_gc = 0b010100 << AMX0N_gp,
    AMX0N_32PIN_VREF_gc = 0b011110 << AMX0N_gp,
    AMX0N_32PIN_GND_gc  = 0b011111 << AMX0N_gp,
};
enum {
    AMX0N_48PIN_P2_0    = 0b000000,
    AMX0N_48PIN_P2_1    = 0b000001,
    AMX0N_48PIN_P2_2    = 0b000010,
    AMX0N_48PIN_P2_3    = 0b000011,
    AMX0N_48PIN_P2_5    = 0b000100,
    AMX0N_48PIN_P2_6    = 0b000101,
    AMX0N_48PIN_P3_0    = 0b000110,
    AMX0N_48PIN_P3_1    = 0b000111,
    AMX0N_48PIN_P3_4    = 0b001000,
    AMX0N_48PIN_P3_5    = 0b001001,
    AMX0N_48PIN_P3_7    = 0b001010,
    AMX0N_48PIN_P4_0    = 0b001011,
    AMX0N_48PIN_P4_3    = 0b001100,
    AMX0N_48PIN_P4_4    = 0b001101,
    AMX0N_48PIN_P4_5    = 0b001110,
    AMX0N_48PIN_P4_6    = 0b001111,
    // AMX0N_48PIN_Px_x = 0b010000,
    AMX0N_48PIN_P0_3    = 0b010001,
    AMX0N_48PIN_P0_4    = 0b010010,
    AMX0N_48PIN_P1_1    = 0b010011,
    AMX0N_48PIN_P1_2    = 0b010100,
    AMX0N_48PIN_P1_0    = 0b010101,
    AMX0N_48PIN_P1_3    = 0b010110,
    AMX0N_48PIN_P1_6    = 0b010111,
    AMX0N_48PIN_P1_7    = 0b011000,
    AMX0N_48PIN_P2_4    = 0b011001,
    AMX0N_48PIN_P2_7    = 0b011010,
    AMX0N_48PIN_P3_2    = 0b011011,
    AMX0N_48PIN_P3_3    = 0b011100,
    AMX0N_48PIN_P3_6    = 0b011101,
    AMX0N_48PIN_VREF    = 0b011110,
    AMX0N_48PIN_GND     = 0b011111,
    AMX0N_48PIN_P4_1    = 0b100000,
    AMX0N_48PIN_P4_2    = 0b100001,
    AMX0N_48PIN_P4_7    = 0b100010,
};
enum {
    AMX0N_48PIN_P2_0_gc = 0b000000 << AMX0N_gp,
    AMX0N_48PIN_P2_1_gc = 0b000001 << AMX0N_gp,
    AMX0N_48PIN_P2_2_gc = 0b000010 << AMX0N_gp,
    AMX0N_48PIN_P2_3_gc = 0b000011 << AMX0N_gp,
    AMX0N_48PIN_P2_5_gc = 0b000100 << AMX0N_gp,
    AMX0N_48PIN_P2_6_gc = 0b000101 << AMX0N_gp,
    AMX0N_48PIN_P3_0_gc = 0b000110 << AMX0N_gp,
    AMX0N_48PIN_P3_1_gc = 0b000111 << AMX0N_gp,
    AMX0N_48PIN_P3_4_gc = 0b001000 << AMX0N_gp,
    AMX0N_48PIN_P3_5_gc = 0b001001 << AMX0N_gp,
    AMX0N_48PIN_P3_7_gc = 0b001010 << AMX0N_gp,
    AMX0N_48PIN_P4_0_gc = 0b001011 << AMX0N_gp,
    AMX0N_48PIN_P4_3_gc = 0b001100 << AMX0N_gp,
    AMX0N_48PIN_P4_4_gc = 0b001101 << AMX0N_gp,
    AMX0N_48PIN_P4_5_gc = 0b001110 << AMX0N_gp,
    AMX0N_48PIN_P4_6_gc = 0b001111 << AMX0N_gp,
    // AMX0N_48PIN_Px_x = 0b010000,
    AMX0N_48PIN_P0_3_gc = 0b010001 << AMX0N_gp,
    AMX0N_48PIN_P0_4_gc = 0b010010 << AMX0N_gp,
    AMX0N_48PIN_P1_1_gc = 0b010011 << AMX0N_gp,
    AMX0N_48PIN_P1_2_gc = 0b010100 << AMX0N_gp,
    AMX0N_48PIN_P1_0_gc = 0b010101 << AMX0N_gp,
    AMX0N_48PIN_P1_3_gc = 0b010110 << AMX0N_gp,
    AMX0N_48PIN_P1_6_gc = 0b010111 << AMX0N_gp,
    AMX0N_48PIN_P1_7_gc = 0b011000 << AMX0N_gp,
    AMX0N_48PIN_P2_4_gc = 0b011001 << AMX0N_gp,
    AMX0N_48PIN_P2_7_gc = 0b011010 << AMX0N_gp,
    AMX0N_48PIN_P3_2_gc = 0b011011 << AMX0N_gp,
    AMX0N_48PIN_P3_3_gc = 0b011100 << AMX0N_gp,
    AMX0N_48PIN_P3_6_gc = 0b011101 << AMX0N_gp,
    AMX0N_48PIN_VREF_gc = 0b011110 << AMX0N_gp,
    AMX0N_48PIN_GND_gc  = 0b011111 << AMX0N_gp,
    AMX0N_48PIN_P4_1_gc = 0b100000 << AMX0N_gp,
    AMX0N_48PIN_P4_2_gc = 0b100001 << AMX0N_gp,
    AMX0N_48PIN_P4_7_gc = 0b100010 << AMX0N_gp,
};

///////////////////////////////////////////////////////////////////////////////
//                        Voltage Reference                                  //
///////////////////////////////////////////////////////////////////////////////

// REF0CN: Reference Control
#define REFBGS_bp 7
#define REFBGS_bm (1 << REFBGS_bp)
#define REGOVR_bp 4
#define REGOVR_bm (1 << REGOVR_bp)
#define REFSL_bp 3
#define REFSL_bm (1 << REFSL_bp)
#define TEMPE_bp 2
#define TEMPE_bm (1 << TEMPE_bp)
#define BIASE_bp 1
#define BIASE_bm (1 << BIASE_bp)
#define REFBE_bp 0
#define REFBE_bm (1 << REFBE_bp)

///////////////////////////////////////////////////////////////////////////////
//                        Comparator                                         //
///////////////////////////////////////////////////////////////////////////////

// CPT0CN: Comparator0 Control
#define CP0EN_bp 7
#define CP0EN_bm (1 << CP0EN_bp)
#define CP0OUT_bp 6
#define CP0OUT_bm (1 << CP0OUT_bp)
#define CP0RIF_bp 5
#define CP0RIF_bm (1 << CP0RIF_bp)
#define CP0FIF_bp 4
#define CP0FIF_bm (1 << CP0FIF_bp)

