ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
#define CP0HYP_gp 2
#define CP0HYP_gm 0x0c
enum {
    CP0HYP_POS_HYSTERESIS_DISABLED = 0b00,
    CP0HYP_POS_HYSTERESIS_5MV      = 0b01,
    CP0HYP_POS_HYSTERESIS_10MV     = 0b10,
    CP0HYP_POS_HYSTERESIS_20MV     = 0b11,
};
enum {
    CP0HYP_POS_HYSTERESIS_DISABLED_gc = 0b00 << CP0HYP_gp,
    CP0HYP_POS_HYSTERESIS_5MV_gc      = 0b01 << CP0HYP_gp,
    CP0HYP_POS_HYSTERESIS_10MV_gc     = 0b10 << CP0HYP_gp,
    CP0HYP_POS_HYSTERESIS_20MV_gc     = 0b11 << CP0HYP_gp,
};

#define CP0HYN_gp 0
#define CP0HYN_gm 0x03
enum {
    CP0HYN_NEG_HYSTERESIS_DISABLED = 0b00,
    CP0HYN_NEG_HYSTERESIS_5MV      = 0b01,
    CP0HYN_NEG_HYSTERESIS_10MV     = 0b10,
    CP0HYN_NEG_HYSTERESIS_20MV     = 0b11,
};
enum {
    CP0HYN_NEG_HYSTERESIS_DISABLED_gc = 0b00 << CP0HYP_gp,
    CP0HYN_NEG_HYSTERESIS_5MV_gc      = 0b01 << CP0HYP_gp,
    CP0HYN_NEG_HYSTERESIS_10MV_gc     = 0b10 << CP0HYP_gp,
    CP0HYN_NEG_HYSTERESIS_20MV_gc     = 0b11 << CP0HYP_gp,
};

// CPT0MD: Comparator0 Mode Selection
#define CP0RIE_bp 5
#define CP0RIE_bm (1 << CP0RIE_bp)
#define CP0FIE_bp 4
#define CP0FIE_bm (1 << CP0FIE_bp)

#define CP0MD_gp 0
#define CP0MD_gm 0x03
enum {
    CP0MD_MODE_0 = 0b00,
    CP0MD_MODE_1 = 0b01,
    CP0MD_MODE_2 = 0b10,
    CP0MD_MODE_3 = 0b11,
};
enum {
    CP0MD_MODE_0_gc = 0b00 << CP0MD_gp,
    CP0MD_MODE_1_gc = 0b01 << CP0MD_gp,
    CP0MD_MODE_2_gc = 0b10 << CP0MD_gp,
    CP0MD_MODE_3_gc = 0b11 << CP0MD_gp,
};

// CPT1CN: Comparator1 Control
#define CP1EN_bp 7
#define CP1EN_bm (1 << CP1EN_bp)
#define CP1OUT_bp 6
#define CP1OUT_bm (1 << CP1OUT_bp)
#define CP1RIF_bp 5
#define CP1RIF_bm (1 << CP1RIF_bp)
#define CP1FIF_bp 4
#define CP1FIF_bm (1 << CP1FIF_bp)

#define CP1HYP_gp 2
#define CP1HYP_gm 0x0c
enum {
    CP1HYP_POS_HYSTERESIS_DISABLED = 0b00,
    CP1HYP_POS_HYSTERESIS_5MV      = 0b01,
    CP1HYP_POS_HYSTERESIS_10MV     = 0b10,
    CP1HYP_POS_HYSTERESIS_20MV     = 0b11,
};
enum {
    CP1HYP_POS_HYSTERESIS_DISABLED_gc = 0b00 << CP1HYP_gp,
    CP1HYP_POS_HYSTERESIS_5MV_gc      = 0b01 << CP1HYP_gp,
    CP1HYP_POS_HYSTERESIS_10MV_gc     = 0b10 << CP1HYP_gp,
    CP1HYP_POS_HYSTERESIS_20MV_gc     = 0b11 << CP1HYP_gp,
};

#define CP1HYN_gp 0
#define CP1HYN_gm 0x03
enum {
    CP1HYN_NEG_HYSTERESIS_DISABLED = 0b00,
    CP1HYN_NEG_HYSTERESIS_5MV      = 0b01,
    CP1HYN_NEG_HYSTERESIS_10MV     = 0b10,
    CP1HYN_NEG_HYSTERESIS_20MV     = 0b11,
};
enum {
    CP1HYN_NEG_HYSTERESIS_DISABLED_gc = 0b00 << CP1HYP_gp,
    CP1HYN_NEG_HYSTERESIS_5MV_gc      = 0b01 << CP1HYP_gp,
    CP1HYN_NEG_HYSTERESIS_10MV_gc     = 0b10 << CP1HYP_gp,
    CP1HYN_NEG_HYSTERESIS_20MV_gc     = 0b11 << CP1HYP_gp,
};

// CPT0MD: Comparator1 Mode Selection
#define CP1RIE_bp 5
#define CP1RIE_bm (1 << CP1RIE_bp)
#define CP1FIE_bp 4
#define CP1FIE_bm (1 << CP1FIE_bp)

#define CP1MD_gp 0
#define CP1MD_gm 0x03
enum {
    CP1MD_MODE_0 = 0b00,
    CP1MD_MODE_1 = 0b01,
    CP1MD_MODE_2 = 0b10,
    CP1MD_MODE_3 = 0b11,
};
enum {
    CP1MD_MODE_0_gc = 0b00 << CP1MD_gp,
    CP1MD_MODE_1_gc = 0b01 << CP1MD_gp,
    CP1MD_MODE_2_gc = 0b10 << CP1MD_gp,
    CP1MD_MODE_3_gc = 0b11 << CP1MD_gp,
};

// CPT0MX: Comparator0 MUX Selection
#define CMX0N_gp 4
#define CMX0N_gm 0x70
enum {
    CMX0N_32PIN_P1_1 = 0b000,
    CMX0N_32PIN_P1_5 = 0b001,
    CMX0N_32PIN_P2_1 = 0b010,
    CMX0N_32PIN_P2_5 = 0b011,
    CMX0N_32PIN_P0_1 = 0b100,
};
enum {
    CMX0N_32PIN_P1_1_gc = 0b000 << CMX0N_gp,
    CMX0N_32PIN_P1_5_gc = 0b001 << CMX0N_gp,
    CMX0N_32PIN_P2_1_gc = 0b010 << CMX0N_gp,
    CMX0N_32PIN_P2_5_gc = 0b011 << CMX0N_gp,
    CMX0N_32PIN_P0_1_gc = 0b100 << CMX0N_gp,
};
enum {
    CMX0N_48PIN_P2_1 = 0b000,
    CMX0N_48PIN_P2_6 = 0b001,
    CMX0N_48PIN_P3_5 = 0b010,
    CMX0N_48PIN_P4_4 = 0b011,
    CMX0N_48PIN_P0_4 = 0b100,
};
enum {
    CMX0N_48PIN_P2_1_gc = 0b000 << CMX0N_gp,
    CMX0N_48PIN_P2_6_gc = 0b001 << CMX0N_gp,
    CMX0N_48PIN_P3_5_gc = 0b010 << CMX0N_gp,
    CMX0N_48PIN_P4_4_gc = 0b011 << CMX0N_gp,
    CMX0N_48PIN_P0_4_gc = 0b100 << CMX0N_gp,
};

#define CMX0P_gp 0
#define CMX0P_gm 0x07
enum {
    CMX0P_32PIN_P1_0 = 0b000,
    CMX0P_32PIN_P1_4 = 0b001,
    CMX0P_32PIN_P2_0 = 0b010,
    CMX0P_32PIN_P2_4 = 0b011,
    CMX0P_32PIN_P0_0 = 0b100,
};
enum {
    CMX0P_32PIN_P1_0_gc = 0b000 << CMX0P_gp,
    CMX0P_32PIN_P1_4_gc = 0b001 << CMX0P_gp,
    CMX0P_32PIN_P2_0_gc = 0b010 << CMX0P_gp,
    CMX0P_32PIN_P2_4_gc = 0b011 << CMX0P_gp,
    CMX0P_32PIN_P0_0_gc = 0b100 << CMX0P_gp,
};
enum {
    CMX0P_48PIN_P2_0 = 0b000,
    CMX0P_48PIN_P2_5 = 0b001,
    CMX0P_48PIN_P3_4 = 0b010,
    CMX0P_48PIN_P4_3 = 0b011,
    CMX0P_48PIN_P0_3 = 0b100,
};
enum {
    CMX0P_48PIN_P2_0_gc = 0b000 << CMX0P_gp,
    CMX0P_48PIN_P2_5_gc = 0b001 << CMX0P_gp,
    CMX0P_48PIN_P3_4_gc = 0b010 << CMX0P_gp,
    CMX0P_48PIN_P4_3_gc = 0b011 << CMX0P_gp,
    CMX0P_48PIN_P0_3_gc = 0b100 << CMX0P_gp,
};

// CPT1MX: Comparator1 MUX Selection
#define CMX1N_gp 4
#define CMX1N_gm 0x70
enum {
    CMX1N_32PIN_P1_3 = 0b000,
    CMX1N_32PIN_P1_7 = 0b001,
    CMX1N_32PIN_P2_3 = 0b010,
    // CMX1N_32PIN_Px_x = 0b011,
    CMX1N_32PIN_P0_5 = 0b100,

    CMX1N_48PIN_P2_3 = 0b000,
    CMX1N_48PIN_P3_1 = 0b001,
    CMX1N_48PIN_P4_0 = 0b010,
    CMX1N_48PIN_P4_6 = 0b011,
    CMX1N_48PIN_P1_2 = 0b100,
};
enum {
    CMX1N_32PIN_P1_3_gc = 0b000 << CMX1N_gp,
    CMX1N_32PIN_P1_7_gc = 0b001 << CMX1N_gp,
    CMX1N_32PIN_P2_3_gc = 0b010 << CMX1N_gp,
    // CMX1N_32PIN_P2_5_gc = 0b011 << CMX1N_gp,
    CMX1N_32PIN_P0_5_gc = 0b100 << CMX1N_gp,

    CMX1N_48PIN_P2_3_gc = 0b000 << CMX1N_gp,
    CMX1N_48PIN_P3_1_gc = 0b001 << CMX1N_gp,
    CMX1N_48PIN_P4_0_gc = 0b010 << CMX1N_gp,
    CMX1N_48PIN_P4_6_gc = 0b011 << CMX1N_gp,
    CMX1N_48PIN_P1_2_gc = 0b100 << CMX1N_gp,
};

#define CMX1P_gp 0
#define CMX1P_gm 0x07
enum {
    CMX1P_32PIN_P1_2 = 0b000,
    CMX1P_32PIN_P1_6 = 0b001,
    CMX1P_32PIN_P2_2 = 0b010,
    // CMX1P_32PIN_Px_x = 0b011,
    CMX1P_32PIN_P0_4 = 0b100,

    CMX1P_48PIN_P2_2 = 0b000,
    CMX1P_48PIN_P3_0 = 0b001,
    CMX1P_48PIN_P3_7 = 0b010,
    CMX1P_48PIN_P4_5 = 0b011,
    CMX1P_48PIN_P1_1 = 0b100,
};
enum {
    CMX1P_32PIN_P1_2_gc = 0b000 << CMX1P_gp,
    CMX1P_32PIN_P1_6_gc = 0b001 << CMX1P_gp,
    CMX1P_32PIN_P2_2_gc = 0b010 << CMX1P_gp,
    // CMX1P_32PIN_Px_x_gc = 0b011 << CMX1P_gp,
    CMX1P_32PIN_P0_4_gc = 0b100 << CMX1P_gp,

