ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
    CMX1P_48PIN_P2_2_gc = 0b000 << CMX1P_gp,
    CMX1P_48PIN_P3_0_gc = 0b001 << CMX1P_gp,
    CMX1P_48PIN_P3_7_gc = 0b010 << CMX1P_gp,
    CMX1P_48PIN_P4_5_gc = 0b011 << CMX1P_gp,
    CMX1P_48PIN_P1_1_gc = 0b100 << CMX1P_gp,
};

///////////////////////////////////////////////////////////////////////////////
//                        Voltage Regulator                                  //
///////////////////////////////////////////////////////////////////////////////

// REG01CN: Voltage Regulator Control
#define REG0DIS_bp 7
#define REG0DIS_bm (1 << REG0DIS_bp)
#define VBSTAT_bp 6
#define VBSTAT_bm (1 << VBSTAT_bp)
#define REG0MD_bp 4
#define REG0MD_bm (1 << REG0MD_bp)
#define STOPCF_bp 3
#define STOPCF_bm (1 << STOPCF_bp)
#define REG1MD_bp 1
#define REG1MD_bm (1 << REG1MD_bp)

///////////////////////////////////////////////////////////////////////////////
//                        Power Management                                   //
///////////////////////////////////////////////////////////////////////////////

// PCON: Power Control
#define PCON_GF5_bp 7
#define PCON_GF5_bm (1 << PCON_GPF_5_bp)
#define PCON_GF4_bp 6
#define PCON_GF4_bm (1 << PCON_GPF_4_bp)
#define PCON_GF3_bp 5
#define PCON_GF3_bm (1 << PCON_GPF_3_bp)
#define PCON_GF2_bp 4
#define PCON_GF2_bm (1 << PCON_GPF_2_bp)
#define PCON_GF1_bp 3
#define PCON_GF1_bm (1 << PCON_GPF_1_bp)
#define PCON_GF0_bp 2
#define PCON_GF0_bm (1 << PCON_GPF_0_bp)
#define STOP_bp 1
#define STOP_bm (1 << STOP_bp)
#define IDLE_bp 0
#define IDLE_bm (1 << IDLE_bp)

///////////////////////////////////////////////////////////////////////////////
//                        Prefetch                                           //
///////////////////////////////////////////////////////////////////////////////

// PFE0CN: Prefetch Engine Control
#define PFEN_bp 5
#define PFEN_bm (1 << PFEN_bp)
#define FLBWE_bp 0
#define FLBWE_bm (1 << FLBWE_bp)

///////////////////////////////////////////////////////////////////////////////
//                     External Memory Interface                             //
///////////////////////////////////////////////////////////////////////////////

// EMI0CF: External Memory Interface Configuration
#define USBFAE_bp 6
#define USBFAE_bm (1 << USBFAE_bp)
#define EMD2_bp 4
#define EMD2_bm (1 << EMD2_bp)

#define EMD_gp 0
#define EMD_gm 0x0c
enum {
    EMD_INTERNAL_ONLY     = 0b00,
    EMD_SPLIT             = 0b01,
    EMD_SPLIT_BANK_SELECT = 0b10,
    EMD_EXTERNAL_ONLY     = 0b11,
};
enum {
    EMD_INTERNAL_ONLY_gc     = 0b00 << EMD_gp,
    EMD_SPLIT_gc             = 0b01 << EMD_gp,
    EMD_SPLIT_BANK_SELECT_gc = 0b10 << EMD_gp,
    EMD_EXTERNAL_ONLY_gc     = 0b11 << EMD_gp,
};

#define EALE_gp 0
#define EALE_gm 0x03
enum {
    EALE_1_CYCLE = 0b00,
    EALE_2_CYCLE = 0b01,
    EALE_3_CYCLE = 0b10,
    EALE_4_CYCLE = 0b11,
};
enum {
    EALE_1_CYCLE_gc = 0b00 << EALE_gp,
    EALE_2_CYCLE_gc = 0b01 << EALE_gp,
    EALE_3_CYCLE_gc = 0b10 << EALE_gp,
    EALE_4_CYCLE_gc = 0b11 << EALE_gp,
};


///////////////////////////////////////////////////////////////////////////////
//                         Interrupts                                        //
///////////////////////////////////////////////////////////////////////////////

// IE: Interrupt Enable
#define EA_bp 7
#define EA_bm (1 << EA_bp)
#define ESPI0_bp 6
#define ESPI0_bm (1 << ESPI0_bp)
#define ET2_bp 5
#define ET2_bm (1 << ET2_bp)
#define ES0_bp 4
#define ES0_bm (1 << ES0_bp)
#define ET1_bp 3
#define ET1_bm (1 << ET1_bp)
#define EX1_bp 2
#define EX1_bm (1 << EX1_bp)
#define ET0_bp 1
#define ET0_bm (1 << ET0_bp)
#define EX0_bp 0
#define EX0_bm (1 << EX0_bp)

// IP: Interrupt Priority
#define PSPI0_bp 6
#define PSPI0_bm (1 << PSPI0_bp)
#define PT2_bp 5
#define PT2_bm (1 << PT2_bp)
#define PS0_bp 4
#define PS0_bm (1 << PS0_bp)
#define PT1_bp 3
#define PT1_bm (1 << PT1_bp)
#define PX1_bp 2
#define PX1_bm (1 << PX1_bp)
#define PT0_bp 1
#define PT0_bm (1 << PT0_bp)
#define PX0_bp 0
#define PX0_bm (1 << PX0_bp)

// EIE1: Extended Interrupt Enable 1
#define ET3_bp 7
#define ET3_bm (1 << ET3_bp)
#define ECP1_bp 6
#define ECP1_bm (1 << ECP1_bp)
#define ECP0_bp 5
#define ECP0_bm (1 << ECP0_bp)
#define EPCA0_bp 4
#define EPCA0_bm (1 << EPCA0_bp)
#define EADC0_bp 3
#define EADC0_bm (1 << EADC0_bp)
#define EWADC0_bp 2
#define EWADC0_bm (1 << EWADC0_bp)
#define EUSB0_bp 1
#define EUSB0_bm (1 << EUSB0_bp)
#define ESMB0_bp 0
#define ESMB0_bm (1 << ESMB0_bp)

// EIP1: Extended Interrupt Priority 1
#define PT3_bp 7
#define PT3_bm (1 << PT3_bp)
#define PCP1_bp 7
#define PCP1_bm (1 << PCP1_bp)
#define PCP0_bp 7
#define PCP0_bm (1 << PCP0_bp)
#define PPCA0_bp 7
#define PPCA0_bm (1 << PPCA0_bp)
#define PADC0_bp 7
#define PADC0_bm (1 << PADC0_bp)
#define PWADC0_bp 7
#define PWADC0_bm (1 << PWADC0_bp)
#define PUSB0_bp 7
#define PUSB0_bm (1 << PUSB0_bp)
#define PSMB0_bp 7
#define PSMB0_bm (1 << PSMB0_bp)

// EIP2: Extended Interrupt Priority 2
#define PT5_bp 5
#define PT5_bm (1 << PT5_bp)
#define PT4_bp 4
#define PT4_bm (1 << PT4_bp)
#define PSMB1_bp 3
#define PSMB1_bm (1 << PSMB1_bp)
#define PS1_bp 1
#define PS1_bm (1 << PS1_bp)
#define PVBUS_bp 0
#define PVBUS_bm (1 << PVBUS_bp)

// IT01CF: INT0/INT1 Configuration
#define IN1PL_bp 7
#define IN1PL_bm (1 << IN1PL_bp)

#define IN1SL_gp 4
#define IN1SL_gm 0x70
enum {
    IN1SL_P0_0 = 0b000,
    IN1SL_P0_1 = 0b001,
    IN1SL_P0_2 = 0b010,
    IN1SL_P0_3 = 0b011,
    IN1SL_P0_4 = 0b100,
    IN1SL_P0_5 = 0b101,
    IN1SL_P0_6 = 0b110,
    IN1SL_P0_7 = 0b111,
};
enum {
    IN1SL_P0_0_gc = 0b000 << IN1SL_gp,
    IN1SL_P0_1_gc = 0b001 << IN1SL_gp,
    IN1SL_P0_2_gc = 0b010 << IN1SL_gp,
    IN1SL_P0_3_gc = 0b011 << IN1SL_gp,
    IN1SL_P0_4_gc = 0b100 << IN1SL_gp,
    IN1SL_P0_5_gc = 0b101 << IN1SL_gp,
    IN1SL_P0_6_gc = 0b110 << IN1SL_gp,
    IN1SL_P0_7_gc = 0b111 << IN1SL_gp,
};

#define IN0PL_bp 3
#define IN0PL_bm (1 << IN0PL_bp)

#define IN0SL_gp 0
#define IN0SL_gm 0x07
enum {
    IN0SL_P0_0 = 0b000,
    IN0SL_P0_1 = 0b001,
    IN0SL_P0_2 = 0b010,
    IN0SL_P0_3 = 0b011,
    IN0SL_P0_4 = 0b100,
    IN0SL_P0_5 = 0b101,
    IN0SL_P0_6 = 0b110,
    IN0SL_P0_7 = 0b111,
};
enum {
    IN0SL_P0_0_gc = 0b000 << IN0SL_gp,
    IN0SL_P0_1_gc = 0b001 << IN0SL_gp,
    IN0SL_P0_2_gc = 0b010 << IN0SL_gp,
    IN0SL_P0_3_gc = 0b011 << IN0SL_gp,
    IN0SL_P0_4_gc = 0b100 << IN0SL_gp,
    IN0SL_P0_5_gc = 0b101 << IN0SL_gp,
    IN0SL_P0_6_gc = 0b110 << IN0SL_gp,
    IN0SL_P0_7_gc = 0b111 << IN0SL_gp,
};


///////////////////////////////////////////////////////////////////////////////
//                         Power-on Reset                                    //
///////////////////////////////////////////////////////////////////////////////

//
// VDM0CN: V DD Monitor Control
//
#define VDMEN_bp 7
#define VDMEN_bm (1 << VDMEN_bp)
#define VDDSTAT_bp 6
#define VDDSTAT_bm (1 << VDDSTAT_bp)

//
// RSTSRC: Reset Source
//
#define USBRSF_bp 7
#define USBRSF_bm (1 << USBRSF_bp)
#define FERROR_bp 6
#define FERROR_bm (1 << FERROR_bp)
#define C0RSEF_bp 5
#define C0RSEF_bm (1 << C0RSEF_bp)
#define SWRSF_bp 4
#define SWRSF_bm (1 << SWRSF_bp)
#define WDTRSF_bp 3
#define WDTRSF_bm (1 << WDTRSF_bp)
#define MCDRSF_bp 2
#define MCDRSF_bm (1 << MCDRSF_bp)
#define PORSF_bp 1
#define PORSF_bm (1 << PORSF_bp)
#define PINRSF_bp 0
#define PINRSF_bm (1 << PINRSF_bp)

///////////////////////////////////////////////////////////////////////////////
//                         Flash settings                                    //
///////////////////////////////////////////////////////////////////////////////

//
// PSCTL: Program Store R/W Control
//
#define PSEE_bp 1
#define PSEE_bm (1 << PSEE_bp)
#define PSWE_bp 0
#define PSWE_bm (1 << PSWE_bp)

//
// FLSCL: Flash Scale
//
#define FOSE_bp 7
#define FOSE_bm (1 << FOSE_bp)
#define FLRT_bp 4
#define FLRT_bm (1 << FLRT_bp)

///////////////////////////////////////////////////////////////////////////////
//                         Clock settings                                    //
///////////////////////////////////////////////////////////////////////////////

//
// CLKSEL: Clock Select
//

// USBCLK: USB Clock Source
#define USBCLK_gp 4
#define USBCLK_gm 0x70
enum {
    USBCLK_INTERNAL_HF_OSC       = 0b000,
    USBCLK_INTERNAL_HF_OSC_DIV_8 = 0b001,
    USBCLK_EXTERNAL_OSC          = 0b010,
    USBCLK_EXTERNAL_OSC_DIV_2    = 0b011,
    USBCLK_EXTERNAL_OSC_DIV_3    = 0b100,
    USBCLK_EXTERNAL_OSC_DIV_4    = 0b101,
    USBCLK_INTERNAL_LF_OSC       = 0b110,
};
enum {
    USBCLK_INTERNAL_HF_OSC_gc       = 0b000 << USBCLK_gp,
    USBCLK_INTERNAL_HF_OSC_DIV_8_gc = 0b001 << USBCLK_gp,
    USBCLK_EXTERNAL_OSC_gc          = 0b010 << USBCLK_gp,
    USBCLK_EXTERNAL_OSC_DIV_2_gc    = 0b011 << USBCLK_gp,
    USBCLK_EXTERNAL_OSC_DIV_3_gc    = 0b100 << USBCLK_gp,
    USBCLK_EXTERNAL_OSC_DIV_4_gc    = 0b101 << USBCLK_gp,
    USBCLK_INTERNAL_LF_OSC_gc       = 0b110 << USBCLK_gp,
};

// OUTCLK: Crossbar Clock Out Select.
#define OUTCLK_bp 3
#define OUTCLK_bm (1 << OUTCLK_bp)

