ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
// SYSCLK: System Clock Source Select Bits.
#define SYSCLK_gp 0
#define SYSCLK_gm 0x07
enum {
    SYSCLK_INTERNAL_HF_OSC_DIV_4 = 0b000,
    SYSCLK_EXTERNAL_OSC          = 0b001,
    SYSCLK_INTERNAL_HF_OSC_DIV_2 = 0b010,
    SYSCLK_INTERNAL_HF_OSC       = 0b011,
    SYSCLK_INTERNAL_LF_OSC       = 0b100,
};
enum {
    SYSCLK_INTERNAL_HF_OSC_DIV_4_gc = 0b000 << SYSCLK_gp,
    SYSCLK_EXTERNAL_OSC_gc          = 0b001 << SYSCLK_gp,
    SYSCLK_INTERNAL_HF_OSC_DIV_2_gc = 0b010 << SYSCLK_gp,
    SYSCLK_INTERNAL_HF_OSC_gc       = 0b011 << SYSCLK_gp,
    SYSCLK_INTERNAL_LF_OSC_gc       = 0b100 << SYSCLK_gp,
};

//
// OSCICN: Internal H-F Oscillator Control
//
#define IOSCEN_bp 7
#define IOSCEN_bm (1 << IOSCEN_bp)

#define IFRDY_bp 6
#define IFRDY_bm (1 << IFRDY_bp)

#define SUSPEND_bp 5
#define SUSPEND_bm (1 << SUSPEND_bp)

#define IFCN_gp 0
#define IFCN_gm 0x03
enum {
    IFCN_DIV_8 = 0b00,
    IFCN_DIV_4 = 0b01,
    IFCN_DIV_2 = 0b10,
    IFCN_DIV_1 = 0b11,
};
enum {
    IFCN_DIV_8_gc = 0b00 << IFCN_gp,
    IFCN_DIV_4_gc = 0b01 << IFCN_gp,
    IFCN_DIV_2_gc = 0b10 << IFCN_gp,
    IFCN_DIV_1_gc = 0b11 << IFCN_gp,
};

//
// CLKMUL: Clock Multiplier Control
//
#define MULEN_bp 7
#define MULEN_bm (1 << MULEN_bp)

#define MULINIT_bp 6
#define MULINIT_bm (1 << MULINIT)

#define MULRDY_bp 5
#define MULRDY_bm (1 << MULRDY_bp)

#define MULSEL_gp 0
#define MULSEL_gm 0x03

//
// OSCLCN: Internal L-F Oscillator Control
//
#define OSCLEN_bp 7
#define OSCLEN_bm (1 << OSCLEN_bp)

#define OSCLRDY_bp 6
#define OSCLRDY_bm (1 << OSCLRDY_bp)

#define OSCLF_gp 2
#define OSCLF_gm 0x3c

#define OSCLD_gp 0
#define OSCLD_gm 0x03
enum {
    OSCLD_DIV_8 = 0b00,
    OSCLD_DIV_4 = 0b01,
    OSCLD_DIV_2 = 0b10,
    OSCLD_DIV_1 = 0b11,
};
enum {
    OSCLD_DIV_8_gc = 0b00 << OSCLD_gp,
    OSCLD_DIV_4_gc = 0b01 << OSCLD_gp,
    OSCLD_DIV_2_gc = 0b10 << OSCLD_gp,
    OSCLD_DIV_1_gc = 0b11 << OSCLD_gp,
};

//
// OSCXCN: External Oscillator Control
//
#define XCLKVLD_bp 7
#define XCLKVLD_bm (1 << XCLKVLD_bp)

// XOSCMD: External Oscillator Mode Select.
#define XOSCMD_gp 4
#define XOSCMD_gm 0x70
enum {
    XOSCMD_OFF        = 0b000,
    // 00x: External Oscillator circuit off.
    XOSCMD_CMOS       = 0b010, // External CMOS Clock Mode.
    XOSCMD_CMOS_DIV_2 = 0b011, // External CMOS Clock Mode with divide-by-2 stage.
    XOSCMD_RC_DIV_2   = 0b100, // RC Oscillator Mode with divide-by-2 stage.
    XOSCMD_C_DIV_2    = 0b101, // Capacitor Oscillator Mode with divide-by-2 stage.
    XOSCMD_XTAL       = 0b110, // Crystal Oscillator Mode.
    XOSCMD_XTAL_DIV2  = 0b111, // Crystal Oscillator Mode with divide-by-2 stage.
};

enum {
    XOSCMD_OFF_gc        = 0b000 << XOSCMD_gp,
    // 00x: External Oscillator circuit off.
    XOSCMD_CMOS_gc       = 0b010 << XOSCMD_gp, // External CMOS Clock Mode.
    XOSCMD_CMOS_DIV_2_gc = 0b011 << XOSCMD_gp, // External CMOS Clock Mode with divide-by-2 stage.
    XOSCMD_RC_DIV_2_gc   = 0b100 << XOSCMD_gp, // RC Oscillator Mode with divide-by-2 stage.
    XOSCMD_C_DIV_2_gc    = 0b101 << XOSCMD_gp, // Capacitor Oscillator Mode with divide-by-2 stage.
    XOSCMD_XTAL_gc       = 0b110 << XOSCMD_gp, // Crystal Oscillator Mode.
    XOSCMD_XTAL_DIV2_gc  = 0b111 << XOSCMD_gp, // Crystal Oscillator Mode with divide-by-2 stage.
};

#define XFCN_gp 0
#define XFCN_gm 0x07

///////////////////////////////////////////////////////////////////////////////
//                         GPIO settings                                     //
///////////////////////////////////////////////////////////////////////////////

//
// XBR0: Port I/O Crossbar Register 0
//
#define CP1AE_bp 7
#define CP1AE_bm (1 << CP1AE_bp)
#define CP1E_bp 6
#define CP1E_bm (1 << CP1E_bp)
#define CP0AE_bp 5
#define CP0AE_bm (1 << CP0AE_bp)
#define CP0E_bp 4
#define CP0E_bm (1 << CP0E_bp)
#define SYSCKE_bp 3
#define SYSCKE_bm (1 << SYSCKE_bp)
#define SMB0E_bp 2
#define SMB0E_bm (1 << SMB0E_bp)
#define SPI0E_bp 1
#define SPI0E_bm (1 << SPI0E_bp)
#define URT0E_bp 0
#define URT0E_bm (1 << URT0E_bp)

//
// XBR1: Port I/O Crossbar Register 1
//
#define WEAKPUD_bp 7
#define WEAKPUD_bm (1 << WEAKPUD_bp)
#define XBARE_bp 6
#define XBARE_bm (1 << XBARE_bp)
#define T1E_bp 5
#define T1E_bm (1 << T1E_bp)
#define T0E_bp 4
#define T0E_bm (1 << T0E_bp)
#define ECIE_bp 3
#define ECIE_bm (1 << ECIE_bp)

// PCA0ME: PCA Module I/O Enable Bits.
#define PCA0ME_gp 0
#define PCA0ME_gm 0x07

//
// XBR1: Port I/O Crossbar Register 1
//
#define SMB1E_bp 1
#define SMB1E_bm (1 << SMB1E_bp)
#define URT1E_bp 0
#define URT1E_bm (1 << URT1E_bp)

#define PIN0_bm (1 << 0)
#define PIN1_bm (1 << 1)
#define PIN2_bm (1 << 2)
#define PIN3_bm (1 << 3)
#define PIN4_bm (1 << 4)
#define PIN5_bm (1 << 5)
#define PIN6_bm (1 << 6)
#define PIN7_bm (1 << 7)

///////////////////////////////////////////////////////////////////////////////
//                              SMBUS                                        //
///////////////////////////////////////////////////////////////////////////////

// SMB0CF: SMBus Clock/Configuration
#define ENSMB0_bp 7
#define ENSMB0_bm (1 << ENSMB0_bp)
#define INH0_bp 6
#define INH0_bm (1 << INH0_bp)
#define BUSY0_bp 5
#define BUSY0_bm (1 << BUSY0_bp)
#define EXTHOLD0_bp 4
#define EXTHOLD0_bm (1 << EXTHOLD0_bp)
#define SMB0TOE_bp 3
#define SMB0TOE_bm (1 << SMB0TOE_bp)
#define SMB0FTE_bp 2
#define SMB0FTE_bm (1 << SMB0FTE_bp)

#define SMB0CS_gp 0
#define SMB0CS_gm 0x03
enum {
    SMB0CS_TIMER0_OVF    = 0b00,
    SMB0CS_TIMER1_OVF    = 0b01,
    SMB0CS_TIMER2_OVF_HI = 0b10,
    SMB0CS_TIMER2_OVF_LO = 0b11,
};
enum {
    SMB0CS_TIMER0_OVF_gc    = 0b00 << SMB0CS_gp,
    SMB0CS_TIMER1_OVF_gc    = 0b01 << SMB0CS_gp,
    SMB0CS_TIMER2_OVF_HI_gc = 0b10 << SMB0CS_gp,
    SMB0CS_TIMER2_OVF_LO_gc = 0b11 << SMB0CS_gp,
};

// SMB1CF: SMBus Clock/Configuration
#define ENSMB1_bp 7
#define ENSMB1_bm (1 << ENSMB1_bp)
#define INH1_bp 6
#define INH1_bm (1 << INH1_bp)
#define BUSY1_bp 5
#define BUSY1_bm (1 << BUSY1_bp)
#define EXTHOLD1_bp 4
#define EXTHOLD1_bm (1 << EXTHOLD1_bp)
#define SMB1TOE_bp 3
#define SMB1TOE_bm (1 << SMB1TOE_bp)
#define SMB1FTE_bp 2
#define SMB1FTE_bm (1 << SMB1FTE_bp)

#define SMB1CS_gp 0
#define SMB1CS_gm 0x03
enum {
    SMB1CS_TIMER0_OVF    = 0b00,
    SMB1CS_TIMER1_OVF    = 0b01,
    SMB1CS_TIMER2_OVF_HI = 0b10,
    SMB1CS_TIMER2_OVF_LO = 0b11,
};
enum {
    SMB1CS_TIMER0_OVF_gc    = 0b00 << SMB1CS_gp,
    SMB1CS_TIMER1_OVF_gc    = 0b01 << SMB1CS_gp,
    SMB1CS_TIMER2_OVF_HI_gc = 0b10 << SMB1CS_gp,
    SMB1CS_TIMER2_OVF_LO_gc = 0b11 << SMB1CS_gp,
};

