ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
// SMBTC: SMBus Timing Control

#define SMB1SDD_gp 2
#define SMB1SDD_gm 0x0c
enum {
    SMB1SDD_0_CYCLES = 0b00,
    SMB1SDD_2_CYCLES = 0b01,
    SMB1SDD_4_CYCLES = 0b10,
    SMB1SDD_8_CYCLES = 0b11,
};
enum {
    SMB1SDD_0_CYCLES_gc = 0b00 << SMB1SDD_gp,
    SMB1SDD_2_CYCLES_gc = 0b01 << SMB1SDD_gp,
    SMB1SDD_4_CYCLES_gc = 0b10 << SMB1SDD_gp,
    SMB1SDD_8_CYCLES_gc = 0b11 << SMB1SDD_gp,
};

#define SMB0SDD_gp 0
#define SMB0SDD_gm 0x03
enum {
    SMB0SDD_0_CYCLES = 0b00,
    SMB0SDD_2_CYCLES = 0b01,
    SMB0SDD_4_CYCLES = 0b10,
    SMB0SDD_8_CYCLES = 0b11,
};
enum {
    SMB0SDD_0_CYCLES_gc = 0b00 << SMB0SDD_gp,
    SMB0SDD_2_CYCLES_gc = 0b01 << SMB0SDD_gp,
    SMB0SDD_4_CYCLES_gc = 0b10 << SMB0SDD_gp,
    SMB0SDD_8_CYCLES_gc = 0b11 << SMB0SDD_gp,
};


// SMB0CN: SMBus Control
#define MASTER0_bp 7
#define MASTER0_bm (1 << MASTER0_bp)
#define TXMODE0_bp 6
#define TXMODE0_bm (1 << TXMODE0_bp)
#define STA0_bp 5
#define STA0_bm (1 << STA0_bp)
#define STO0_bp 4
#define STO0_bm (1 << STO0_bp)
#define ACKRQ0_bp 3
#define ACKRQ0_bm (1 << ACKRQ0_bp)
#define ARBLOST0_bp 2
#define ARBLOST0_bm (1 << ARBLOST0_bp)
#define ACK0_bp 1
#define ACK0_bm (1 << ACK0_bp)
#define SI0_bp 0
#define SI0_bm (1 << SI0_bp)

// SMB1CN: SMBus Control
#define MASTER1_bp 7
#define MASTER1_bm (1 << MASTER1_bp)
#define TXMODE1_bp 6
#define TXMODE1_bm (1 << TXMODE1_bp)
#define STA1_bp 5
#define STA1_bm (1 << STA1_bp)
#define STO1_bp 4
#define STO1_bm (1 << STO1_bp)
#define ACKRQ1_bp 3
#define ACKRQ1_bm (1 << ACKRQ1_bp)
#define ARBLOST1_bp 2
#define ARBLOST1_bm (1 << ARBLOST1_bp)
#define ACK1_bp 1
#define ACK1_bm (1 << ACK1_bp)
#define SI1_bp 0
#define SI1_bm (1 << SI1_bp)

// SMB0ADR: SMBus0 Slave Address

#define SLV0_gp 1
#define SLV0_gm 0xfe

#define GC0_bp 0
#define GC0_bm (1 << GC0_bp)

// SMB0ADM: SMBus0 Slave Address Mask
#define SLVM0_gp 1
#define SLVM0_gpm 0xfe

#define EHACK0_bp 0
#define EHACK0_bm (1 << EHACK0_bp)

// SMB1ADR: SMBus1 Slave Address

#define SLV1_gp 1
#define SLV1_gm 0xfe

#define GC1_bp 0
#define GC1_bm (1 << GC0_bp)

// SMB1ADM: SMBus1 Slave Address Mask
#define SLVM1_gp 1
#define SLVM1_gm 0xfe

#define EHACK1_bp 0
#define EHACK1_bm (1 << EHACK1_bp)

///////////////////////////////////////////////////////////////////////////////
//                              UART                                         //
///////////////////////////////////////////////////////////////////////////////

// SCON0: Serial Port 0 Control
#define S0MODE_bp 7
#define S0MODE_bm (1 << S0MODE_bp)
#define MCE0_bp 5
#define MCE0_bm (1 << MCE0_bp)
#define REN0_bp 4
#define REN0_bm (1 << REN0_bp)
#define TB80_bp 3
#define TB80_bm (1 << TB80_bp)
#define RB80_bp 2
#define RB80_bm (1 << RB80_bp)
#define TI0_bp 1
#define TI0_bm (1 << TI0_bp)
#define RI0_bp 0
#define RI0_bm (1 << RI0_bp)

// SCON1: UART1 Control
#define OVR1_bp 7
#define OVR1_bm (1 << OVR1_bp)
#define PERR1_bp 6
#define PERR1_bm (1 << PERR1_bp)
#define THRE1_bp 5
#define THRE1_bm (1 << THRE1_bp)
#define REN1_bp 4
#define REN1_bm (1 << REN1_bp)
#define TBX1_bp 3
#define TBX1_bm (1 << TBX1_bp)
#define RBX1_bp 2
#define RBX1_bm (1 << RBX1_bp)
#define TI1_bp 1
#define TI1_bm (1 << TI1_bp)
#define RI1_bp 0
#define RI1_bm (1 << RI1_bp)

// SMOD1: UART1 Mode
#define MCE1_bp 7
#define MCE1_bm (1 << MCE1_bp)

#define S1PT_gp 5
#define S1PT_gm 0x60
enum {
    S1PT_ODD   = 0b00,
    S1PT_EVEN  = 0b01,
    S1PT_MARK  = 0b10,
    S1PT_SPACE = 0b11,
};
enum {
    S1PT_ODD_gc   = 0b00 << S1PT_gp,
    S1PT_EVEN_gc  = 0b01 << S1PT_gp,
    S1PT_MARK_gc  = 0b10 << S1PT_gp,
    S1PT_SPACE_gc = 0b11 << S1PT_gp,
};

#define PE1_bp 4
#define PE1_bm (1 << PE1_bp)

#define S1DL_gp 2
#define S1DL_gm 0xc0
enum {
    S1DL_5_BIT = 0b00,
    S1DL_6_BIT = 0b01,
    S1DL_7_BIT = 0b10,
    S1DL_8_BIT = 0b11,
};
enum {
    S1DL_5_BIT_gc = 0b00 << S1DL_gp,
    S1DL_6_BIT_gc = 0b01 << S1DL_gp,
    S1DL_7_BIT_gc = 0b10 << S1DL_gp,
    S1DL_8_BIT_gc = 0b11 << S1DL_gp,
};

#define XBE1_bp 1
#define XBE1_bm (1 << XBE1_bp)
#define SBL1_bp 0
#define SBL1_bm (1 << SBL1_bp)

// SBCON1: UART1 Baud Rate Generator Control
#define SB1RUN_bp 6
#define SB1RUN_bm (1 << SB1RUN_bp)

#define SB1PS_gp 0
#define SB1PS_gm 0x03
enum {
    SB1PS_PRESCALE_12 = 0b00,
    SB1PS_PRESCALE_4  = 0b01,
    SB1PS_PRESCALE_48 = 0b10,
    SB1PS_PRESCALE_1  = 0b11,
};
enum {
    SB1PS_PRESCALE_12_gc = 0b00 << SB1PS_gp,
    SB1PS_PRESCALE_4_gc  = 0b01 << SB1PS_gp,
    SB1PS_PRESCALE_48_gc = 0b10 << SB1PS_gp,
    SB1PS_PRESCALE_1_gc  = 0b11 << SB1PS_gp,
};

///////////////////////////////////////////////////////////////////////////////
//                              SPI                                          //
///////////////////////////////////////////////////////////////////////////////

// SPI0CFG: SPI0 Configuration
#define SPIBSY_bp 7
#define SPIBSY_bm (1 << SPIBSY_bp)
#define MSTEN_bp 6
#define MSTEN_bm (1 << MSTEN_bp)
#define CKPHA_bp 5
#define CKPHA_bm (1 << CKPHA_bp)
#define CKPOL_bp 4
#define CKPOL_bm (1 << CKPOL_bp)
#define SLVSEL_bp 3
#define SLVSEL_bm (1 << SLVSEL_bp)
#define NSSIN_bp 2
#define NSSIN_bm (1 << NSSIN_bp)
#define SRMT_bp 1
#define SRMT_bm (1 << SRMT_bp)
#define RXBMT_bp 0
#define RXBMT_bm (1 << RXBMT_bp)

// SPI0CN: SPI0 Control
#define SPIF_bp 7
#define SPIF_bm (1 << SPIF_bp)
#define WCOL_bp 6
#define WCOL_bm (1 << WCOL_bp)
#define MODF_bp 5
#define MODF_bm (1 << MODF_bp)
#define RXOVRN_bp 4
#define RXOVRN_bm (1 << RXOVRN_bp)

#define NSSMD_gp 0
#define NSSMD_gm 0x0c
enum {
    NSSMD_3_WIRE = 0b00,
    NSSMD_4_WIRE_SLAVE_MASTER = 0b01,
    NSSMD_4_WIRE_SINGLE_MASTER = 0b10,
};

#define TXBMT_bp 1
#define TXBMT_bm (1 << TXBMT_bp)
#define SPIEN_bp 0
#define SPIEN_bm (1 << SPIEN_bp)

///////////////////////////////////////////////////////////////////////////////
//                              TIMERS                                       //
///////////////////////////////////////////////////////////////////////////////

// CKCON: Clock Control
#define T3MH_bp 7
#define T3MH_bm (1 << T3MH_bp)
#define T3ML_bp 6
#define T3ML_bm (1 << T3ML_bp)
#define T2MH_bp 5
#define T2MH_bm (1 << T2MH_bp)
#define T2ML_bp 4
#define T2ML_bm (1 << T2ML_bp)
#define T1M_bp 3
#define T1M_bm (1 << T1M_bp)
#define T0M_bp 2
#define T0M_bm (1 << T0M_bp)

#define SCA_gp 0
#define SCA_gm 0x03
enum {
    SCA_SYSTEM_CLK_DIV_12  = 0b00,
    SCA_SYSTEM_CLK_DIV_4   = 0b01,
    SCA_SYSTEM_CLK_DIV_48  = 0b10,
    SCA_EXTERNAL_CLK_DIV_8 = 0b11,
};
enum {
    SCA_SYSTEM_CLK_DIV_12_gc  = 0b00 << SCA_gp,
    SCA_SYSTEM_CLK_DIV_4_gc   = 0b01 << SCA_gp,
    SCA_SYSTEM_CLK_DIV_48_gc  = 0b10 << SCA_gp,
    SCA_EXTERNAL_CLK_DIV_8_gc = 0b11 << SCA_gp,
};

