ahtn/keyplus/c8051f38x/src/c8051f38x_defs.h
// CKCON1: Clock Control 1
#define T5MH_bp 3
#define T5MH_bm (1 << T5MH_bp)
#define T5ML_bp 2
#define T5ML_bm (1 << T5ML_bp)
#define T4MH_bp 1
#define T4MH_bm (1 << T4MH_bp)
#define T4ML_bp 0
#define T4ML_bm (1 << T4ML_bp)

// TCON: Timer Control
#define TF1_bp 7
#define TF1_bm (1 << TF1_bp)
#define TR1_bp 6
#define TR1_bm (1 << TR1_bp)
#define TF0_bp 5
#define TF0_bm (1 << TF0_bp)
#define TR0_bp 4
#define TR0_bm (1 << TR0_bp)
#define IE1_bp 3
#define IE1_bm (1 << IE1_bp)
#define IT1_bp 2
#define IT1_bm (1 << IT1_bp)
#define IE0_bp 1
#define IE0_bm (1 << IE0_bp)
#define IT0_bp 0
#define IT0_bm (1 << IT0_bp)

// TMOD: Timer Mode
#define GATE1_bp 7
#define GATE1_bm (1 << GATE1_bp)
#define CT1_bp 6
#define CT1_bm (1 << CT1_bp)

#define T1M_gp 4
#define T1M_gm 0x30
enum {
    T1M_13_BIT     = 0b00,
    T1M_16_BIT     = 0b01,
    T1M_8_BIT_AUTO = 0b10,
    T1M_INACTIVE   = 0b11,
};
enum {
    T1M_13_BIT_gc     = 0b00 << T1M_gp,
    T1M_16_BIT_gc     = 0b01 << T1M_gp,
    T1M_8_BIT_AUTO_gc = 0b10 << T1M_gp,
    T1M_INACTIVE_gc   = 0b11 << T1M_gp,
};

#define GATE0_bp 3
#define GATE0_bm (1 << GATE0_bp)
#define CT0_bp 2
#define CT0_bm (1 << CT0_bp)
#define T0M_gp 0
#define T0M_gm 0x03
enum {
    T0M_13_BIT     = 0b00,
    T0M_16_BIT     = 0b01,
    T0M_8_BIT_AUTO = 0b10,
    T0M_TWO_8_BIT  = 0b11,
};
enum {
    T0M_13_BIT_gc     = 0b00 << T0M_gp,
    T0M_16_BIT_gc     = 0b01 << T0M_gp,
    T0M_8_BIT_AUTO_gc = 0b10 << T0M_gp,
    T0M_TWO_8_BIT_gc  = 0b11 << T0M_gp,
};

// TMR2CN: Timer 2 Control
#define TF2H_bp 7
#define TF2H_bm (1 << TF2H_bp)
#define TF2L_bp 6
#define TF2L_bm (1 << TF2L_bp)
#define TF2LEN_bp 5
#define TF2LEN_bm (1 << TF2LEN_bp)
#define TF2CEN_bp 4
#define TF2CEN_bm (1 << TF2CEN_bp)
#define T2SPLIT_bp 3
#define T2SPLIT_bm (1 << T2SPLIT_bp)
#define TR2_bp 2
#define TR2_bm (1 << TR2_bp)
#define T2CSS_bp 1
#define T2CSS_bm (1 << T2CSS_bp)
#define T2XCLK_bp 0
#define T2XCLK_bm (1 << T2XCLK_bp)

// TMR3CN: Timer 3 Control
#define TF3H_bp 7
#define TF3H_bm (1 << TF3H_bp)
#define TF3L_bp 6
#define TF3L_bm (1 << TF3L_bp)
#define TF3LEN_bp 5
#define TF3LEN_bm (1 << TF3LEN_bp)
#define TF3CEN_bp 4
#define TF3CEN_bm (1 << TF3CEN_bp)
#define T3SPLIT_bp 3
#define T3SPLIT_bm (1 << T3SPLIT_bp)
#define TR3_bp 2
#define TR3_bm (1 << TR3_bp)
#define T3CSS_bp 1
#define T3CSS_bm (1 << T3CSS_bp)
#define T3XCLK_bp 0
#define T3XCLK_bm (1 << T3XCLK_bp)

// TMR4CN: Timer 4 Control
#define TF4H_bp 7
#define TF4H_bm (1 << TF4H_bp)
#define TF4L_bp 6
#define TF4L_bm (1 << TF4L_bp)
#define TF4LEN_bp 5
#define TF4LEN_bm (1 << TF4LEN_bp)
#define T4SPLIT_bp 3
#define T4SPLIT_bm (1 << T4SPLIT_bp)
#define TR4_bp 2
#define TR4_bm (1 << TR4_bp)
#define T4XCLK_bp 0
#define T4XCLK_bm (1 << T4XCLK_bp)

// TMR5CN: Timer 5 Control
#define TF5H_bp 7
#define TF5H_bm (1 << TF5H_bp)
#define TF5L_bp 6
#define TF5L_bm (1 << TF5L_bp)
#define TF5LEN_bp 5
#define TF5LEN_bm (1 << TF5LEN_bp)
#define T5SPLIT_bp 3
#define T5SPLIT_bm (1 << T5SPLIT_bp)
#define TR5_bp 2
#define TR5_bm (1 << TR5_bp)
#define T5XCLK_bp 0
#define T5XCLK_bm (1 << T5XCLK_bp)

///////////////////////////////////////////////////////////////////////////////
//                       Programmable Counter Array                          //
///////////////////////////////////////////////////////////////////////////////

// PCA0CN: PCA Control
#define CF_bp 7
#define CF_bm (1 << CF_bp)
#define CR_bp 6
#define CR_bm (1 << CR_bp)
#define CCF4_bp 4
#define CCF4_bm (1 << CCF4_bp)
#define CCF3_bp 3
#define CCF3_bm (1 << CCF3_bp)
#define CCF2_bp 2
#define CCF2_bm (1 << CCF2_bp)
#define CCF1_bp 1
#define CCF1_bm (1 << CCF1_bp)
#define CCF0_bp 0
#define CCF0_bm (1 << CCF0_bp)

// PCA0MD: PCA Mode
#define CIDL_bp 7
#define CIDL_bm (1 << CIDL_bp)
#define WDTE_bp 6
#define WDTE_bm (1 << WDTE_bp)
#define WDLCK_bp 5
#define WDLCK_bm (1 << WDLCK_bp)

#define CPS_gp 0
#define CPS_gm 0x0e
enum {
    CPS_SYSTEM_CLK_DIV_12  = 0b000,
    CPS_SYSTEM_CLK_DIV_4   = 0b001,
    CPS_TIMER0_OVF         = 0b010,
    CPS_HI_TO_LO_ECI       = 0b011,
    CPS_SYSTEM_CLK         = 0b100,
    CPS_EXTERNAL_CLK_DIV_8 = 0b101,
};
enum {
    CPS_SYSTEM_CLK_DIV_12_gc  = 0b000 << CPS_gp,
    CPS_SYSTEM_CLK_DIV_4_gc   = 0b001 << CPS_gp,
    CPS_TIMER0_OVF_gc         = 0b010 << CPS_gp,
    CPS_HI_TO_LO_ECI_gc       = 0b011 << CPS_gp,
    CPS_SYSTEM_CLK_gc         = 0b100 << CPS_gp,
    CPS_EXTERNAL_CLK_DIV_8_gc = 0b101 << CPS_gp,
};

#define ECF_bp 0
#define ECF_bm (1 << ECF_bp)

// PCA0CPMn: PCA Capture/Compare Mode
#define PWM16n_bp 7
#define PWM16n_bm (1 << PWM16n_bp)
#define ECOMn_bp 6
#define ECOMn_bm (1 << ECOMn_bp)
#define CAPPn_bp 5
#define CAPPn_bm (1 << CAPPn_bp)
#define CAPNn_bp 4
#define CAPNn_bm (1 << CAPNn_bp)
#define MATn_bp 3
#define MATn_bm (1 << MATn_bp)
#define TOGn_bp 2
#define TOGn_bm (1 << TOGn_bp)
#define PWMn_bp 1
#define PWMn_bm (1 << PWMn_bp)
#define ECCFn_bp 0
#define ECCFn_bm (1 << ECCFn_bp)
